QUESTIONS = [
    {
        "question": "Когда началась Великая Отечественная война?",
        "options": [
            "22 июня 1941 года",
            "1 сентября 1939 года",
            "7 декабря 1941 года",
            "17 сентября 1939 года",
        ],
        "answer": "22 июня 1941 года",
    },
    {
        "question": "Каково кодовое название немецкой операции по вторжению в СССР?",
        "options": ["«Цитадель»", "«Барбаросса»", "«Тайфун»", "«Уран»"],
        "answer": "«Барбаросса»",
    },
    {
        "question": "В какой день Красная армия перешла в контрнаступление под Москвой?",
        "options": [
            "30 ноября 1941 года",
            "5 декабря 1941 года",
            "2 января 1942 года",
            "18 ноября 1942 года",
        ],
        "answer": "5 декабря 1941 года",
    },
    {
        "question": "Какое кодовое название носила операция по окружению германских войск под Сталинградом?",
        "options": ["«Уран»", "«Цитадель»", "«Тайфун»", "«Багратион»"],
        "answer": "«Уран»",
    },
    {
        "question": "Какое сражение считается крупнейшим танковым сражением в истории?",
        "options": [
            "Московская битва",
            "Сталинградская битва",
            "Курская битва",
            "Битва за Дубно – Луцк – Броды",
        ],
        "answer": "Курская битва",
    },
    {
        "question": "Когда капитулировала окружённая 6‑я армия Паулюса под Сталинградом?",
        "options": [
            "31 января 1943 года",
            "2 февраля 1943 года",
            "15 января 1943 года",
            "8 февраля 1943 года",
        ],
        "answer": "2 февраля 1943 года",
    },
    {
        "question": "В какие даты проходила Ялтинская конференция?",
        "options": [
            "28 ноября – 1 декабря 1944",
            "4 – 11 февраля 1945",
            "17 – 25 июля 1945",
            "22 – 30 октября 1944",
        ],
        "answer": "4 – 11 февраля 1945",
    },
    {
        "question": "Кто был Верховным Главнокомандующим Вооружёнными Силами СССР с 8 августа 1941 года?",
        "options": [
            "Георгий Жуков",
            "Семён Тимошенко",
            "Иосиф Сталин",
            "Алексей Антонов",
        ],
        "answer": "Иосиф Сталин",
    },
    {
        "question": "Когда было полностью снято блокадное кольцо Ленинграда?",
        "options": [
            "18 января 1943 года",
            "27 января 1944 года",
            "1 марта 1944 года",
            "5 февраля 1944 года",
        ],
        "answer": "27 января 1944 года",
    },
    {
        "question": "Как называлась немецкая операция, начатая 5 июля 1943 года на Курской дуге?",
        "options": ["«Барбаросса»", "«Цитадель»", "«Тайфун»", "«Уран»"],
        "answer": "«Цитадель»",
    },
]
