QUESTIONS = [
    {
        "question": "Когда произошла Февральская революция в России?",
        "options": ["Январь 1920", "Февраль–март 1917", "Октябрь 1917", "Май 2021"],
        "answer": "Февраль–март 1917"
    },
    {
        "question": "Какой император отрёкся от престола в ходе Февральской революции?",
        "options": ["Александр III", "Николай I", "Николай II", "Пётр III"],
        "answer": "Николай II"
    },
    {
        "question": "Как назывался орган власти, пришедший на смену царю?",
        "options": ["Совет народных комиссаров", "Государственная дума", "Временное правительство",
                    "Учредительное собрание"],
        "answer": "Временное правительство"
    },
    {
        "question": "Какой политической партией руководил Ленин в 1917 году?",
        "options": ["Меньшевики", "Эсеры", "КПРФ", "Большевики"],
        "answer": "Большевики"
    },
    {
        "question": "Какой лозунг стал визитной карточкой большевиков в 1917 году?",
        "options": ["За веру, царя и отечество", "Россия — единая и неделимая", "Долой самодержавие!",
                    "Вся власть Советам!"],
        "answer": "Вся власть Советам!"
    },
    {
        "question": "Какая партия одержала большинство на выборах в Учредительное собрание в 1917 году?",
        "options": ["Большевики", "Эсеры", "Меньшевики", "Кадеты"],
        "answer": "Эсеры"
    },
    {
        "question": "Кто возглавлял Временное правительство на момент Октябрьской революции?",
        "options": ["Александр Керенский", "Павел Милюков", "Лев Троцкий", "Николай II"],
        "answer": "Александр Керенский"
    },
    {
        "question": "Какой орган стал исполнительной властью после Октябрьской революции?",
        "options": ["Государственная дума", "ВЦИК", "Совет народных комиссаров (СНК)", "Учредительное собрание"],
        "answer": "Совет народных комиссаров (СНК)"
    },
    {
        "question": "Какая газета была рупором большевиков в 1917 году?",
        "options": ["Вестник временного правительства", "Кадетская правда", "Правда", "Искра"],
        "answer": "Правда"
    },
    {
        "question": "Какой город был центром Октябрьской революции?",
        "options": ["Москва", "Киев", "Петроград", "Харьков"],
        "answer": "Петроград"
    }
]
